Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/multiprotocol/ble_zigbee_light_prov_wbz450/firmware/src/packs/WBZ450_DFP/component/adchs.h
#define ADCHS_ADCIMCON1_DIFF9(value)          (ADCHS_ADCIMCON1_DIFF9_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_DIFF9_Pos)) /* Assigment of value for DIFF9 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_DIFF9_DIFF_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) Selects AN9 differential input pair as AN9+ and ANN0-  */
#define   ADCHS_ADCIMCON1_DIFF9_SINGLE_Val    _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN9 is using Single-ended mode  */
#define ADCHS_ADCIMCON1_DIFF9_DIFF            (ADCHS_ADCIMCON1_DIFF9_DIFF_Val << ADCHS_ADCIMCON1_DIFF9_Pos) /* (ADCHS_ADCIMCON1) Selects AN9 differential input pair as AN9+ and ANN0- Position  */
#define ADCHS_ADCIMCON1_DIFF9_SINGLE          (ADCHS_ADCIMCON1_DIFF9_SINGLE_Val << ADCHS_ADCIMCON1_DIFF9_Pos) /* (ADCHS_ADCIMCON1) AN9 is using Single-ended mode Position  */
#define ADCHS_ADCIMCON1_SIGN10_Pos            _UINT32_(20)                                         /* (ADCHS_ADCIMCON1) AN10 Signed Data Mode bit Position */
#define ADCHS_ADCIMCON1_SIGN10_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON1_SIGN10_Pos)        /* (ADCHS_ADCIMCON1) AN10 Signed Data Mode bit Mask */
#define ADCHS_ADCIMCON1_SIGN10(value)         (ADCHS_ADCIMCON1_SIGN10_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_SIGN10_Pos)) /* Assigment of value for SIGN10 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_SIGN10_SIGNED_Val   _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) AN10 is using Signed Data mode  */
#define   ADCHS_ADCIMCON1_SIGN10_UNSIGNED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN10 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON1_SIGN10_SIGNED         (ADCHS_ADCIMCON1_SIGN10_SIGNED_Val << ADCHS_ADCIMCON1_SIGN10_Pos) /* (ADCHS_ADCIMCON1) AN10 is using Signed Data mode Position  */
#define ADCHS_ADCIMCON1_SIGN10_UNSIGNED       (ADCHS_ADCIMCON1_SIGN10_UNSIGNED_Val << ADCHS_ADCIMCON1_SIGN10_Pos) /* (ADCHS_ADCIMCON1) AN10 is using Unsigned Data mode Position  */
#define ADCHS_ADCIMCON1_DIFF10_Pos            _UINT32_(21)                                         /* (ADCHS_ADCIMCON1) AN10 Mode bit Position */
#define ADCHS_ADCIMCON1_DIFF10_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON1_DIFF10_Pos)        /* (ADCHS_ADCIMCON1) AN10 Mode bit Mask */
#define ADCHS_ADCIMCON1_DIFF10(value)         (ADCHS_ADCIMCON1_DIFF10_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_DIFF10_Pos)) /* Assigment of value for DIFF10 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_DIFF10_DIFF_Val     _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) Selects AN10 differential input pair as AN10+ and ANN0-  */
#define   ADCHS_ADCIMCON1_DIFF10_SINGLE_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN10 is using Single-ended mode  */
#define ADCHS_ADCIMCON1_DIFF10_DIFF           (ADCHS_ADCIMCON1_DIFF10_DIFF_Val << ADCHS_ADCIMCON1_DIFF10_Pos) /* (ADCHS_ADCIMCON1) Selects AN10 differential input pair as AN10+ and ANN0- Position  */
#define ADCHS_ADCIMCON1_DIFF10_SINGLE         (ADCHS_ADCIMCON1_DIFF10_SINGLE_Val << ADCHS_ADCIMCON1_DIFF10_Pos) /* (ADCHS_ADCIMCON1) AN10 is using Single-ended mode Position  */
#define ADCHS_ADCIMCON1_SIGN11_Pos            _UINT32_(22)                                         /* (ADCHS_ADCIMCON1) AN11 Signed Data Mode bit Position */
#define ADCHS_ADCIMCON1_SIGN11_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON1_SIGN11_Pos)        /* (ADCHS_ADCIMCON1) AN11 Signed Data Mode bit Mask */
#define ADCHS_ADCIMCON1_SIGN11(value)         (ADCHS_ADCIMCON1_SIGN11_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_SIGN11_Pos)) /* Assigment of value for SIGN11 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_SIGN11_SIGNED_Val   _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) AN11 is using Signed Data mode  */
#define   ADCHS_ADCIMCON1_SIGN11_UNSIGNED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN11 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON1_SIGN11_SIGNED         (ADCHS_ADCIMCON1_SIGN11_SIGNED_Val << ADCHS_ADCIMCON1_SIGN11_Pos) /* (ADCHS_ADCIMCON1) AN11 is using Signed Data mode Position  */
#define ADCHS_ADCIMCON1_SIGN11_UNSIGNED       (ADCHS_ADCIMCON1_SIGN11_UNSIGNED_Val << ADCHS_ADCIMCON1_SIGN11_Pos) /* (ADCHS_ADCIMCON1) AN11 is using Unsigned Data mode Position  */
#define ADCHS_ADCIMCON1_DIFF11_Pos            _UINT32_(23)                                         /* (ADCHS_ADCIMCON1) AN11 Mode bit Position */
#define ADCHS_ADCIMCON1_DIFF11_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON1_DIFF11_Pos)        /* (ADCHS_ADCIMCON1) AN11 Mode bit Mask */
#define ADCHS_ADCIMCON1_DIFF11(value)         (ADCHS_ADCIMCON1_DIFF11_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_DIFF11_Pos)) /* Assigment of value for DIFF11 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_DIFF11_DIFF_Val     _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) Selects AN11 differential input pair as AN11+ and ANN0-  */
#define   ADCHS_ADCIMCON1_DIFF11_SINGLE_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN11 is using Single-ended mode  */
#define ADCHS_ADCIMCON1_DIFF11_DIFF           (ADCHS_ADCIMCON1_DIFF11_DIFF_Val << ADCHS_ADCIMCON1_DIFF11_Pos) /* (ADCHS_ADCIMCON1) Selects AN11 differential input pair as AN11+ and ANN0- Position  */
#define ADCHS_ADCIMCON1_DIFF11_SINGLE         (ADCHS_ADCIMCON1_DIFF11_SINGLE_Val << ADCHS_ADCIMCON1_DIFF11_Pos) /* (ADCHS_ADCIMCON1) AN11 is using Single-ended mode Position  */
#define ADCHS_ADCIMCON1_Msk                   _UINT32_(0x00FFFFFF)                                 /* (ADCHS_ADCIMCON1) Register Mask  */


/* -------- ADCHS_ADCIMOD1CLR : (ADCHS Offset: 0x44) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCIMOD1CLR_RESETVALUE          _UINT32_(0x00)                                       /*  (ADCHS_ADCIMOD1CLR) Bit clear register  Reset Value */

#define ADCHS_ADCIMOD1CLR_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADCIMOD1CLR) Register Mask  */


