Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/multiprotocol/ble_zigbee_light_prov_wbz450/firmware/src/packs/WBZ450_DFP/component/adchs.h
#define ADCHS_ADCDMASTAT_RAF_Pos              _UINT32_(0)                                          /* (ADCHS_ADCDMASTAT Position)  */
#define ADCHS_ADCDMASTAT_RAF_Msk              (_UINT32_(0x1) << ADCHS_ADCDMASTAT_RAF_Pos)          /* (ADCHS_ADCDMASTAT Mask) RAF */
#define ADCHS_ADCDMASTAT_RAF(value)           (ADCHS_ADCDMASTAT_RAF_Msk & (_UINT32_(value) << ADCHS_ADCDMASTAT_RAF_Pos)) 
#define ADCHS_ADCDMASTAT_RAF_IEN_Pos          _UINT32_(8)                                          /* (ADCHS_ADCDMASTAT Position)  */
#define ADCHS_ADCDMASTAT_RAF_IEN_Msk          (_UINT32_(0x1) << ADCHS_ADCDMASTAT_RAF_IEN_Pos)      /* (ADCHS_ADCDMASTAT Mask) RAF_IEN */
#define ADCHS_ADCDMASTAT_RAF_IEN(value)       (ADCHS_ADCDMASTAT_RAF_IEN_Msk & (_UINT32_(value) << ADCHS_ADCDMASTAT_RAF_IEN_Pos)) 
#define ADCHS_ADCDMASTAT_RBF_Pos              _UINT32_(16)                                         /* (ADCHS_ADCDMASTAT Position)  */
#define ADCHS_ADCDMASTAT_RBF_Msk              (_UINT32_(0x1) << ADCHS_ADCDMASTAT_RBF_Pos)          /* (ADCHS_ADCDMASTAT Mask) RBF */
#define ADCHS_ADCDMASTAT_RBF(value)           (ADCHS_ADCDMASTAT_RBF_Msk & (_UINT32_(value) << ADCHS_ADCDMASTAT_RBF_Pos)) 
#define ADCHS_ADCDMASTAT_RBF_IEN_Pos          _UINT32_(24)                                         /* (ADCHS_ADCDMASTAT Position)  */
#define ADCHS_ADCDMASTAT_RBF_IEN_Msk          (_UINT32_(0x1) << ADCHS_ADCDMASTAT_RBF_IEN_Pos)      /* (ADCHS_ADCDMASTAT Mask) RBF_IEN */
#define ADCHS_ADCDMASTAT_RBF_IEN(value)       (ADCHS_ADCDMASTAT_RBF_IEN_Msk & (_UINT32_(value) << ADCHS_ADCDMASTAT_RBF_IEN_Pos)) 

/* -------- ADCHS_ADCDMASTATCLR : (ADCHS Offset: 0x314) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCDMASTATCLR_RESETVALUE        _UINT32_(0x00)                                       /*  (ADCHS_ADCDMASTATCLR) Bit clear register  Reset Value */

#define ADCHS_ADCDMASTATCLR_Msk               _UINT32_(0x00000000)                                 /* (ADCHS_ADCDMASTATCLR) Register Mask  */


/* -------- ADCHS_ADCDMASTATSET : (ADCHS Offset: 0x318) (R/W 32) Bit set register -------- */
#define ADCHS_ADCDMASTATSET_RESETVALUE        _UINT32_(0x00)                                       /*  (ADCHS_ADCDMASTATSET) Bit set register  Reset Value */

#define ADCHS_ADCDMASTATSET_Msk               _UINT32_(0x00000000)                                 /* (ADCHS_ADCDMASTATSET) Register Mask  */


/* -------- ADCHS_ADCDMASTATINV : (ADCHS Offset: 0x31C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCDMASTATINV_RESETVALUE        _UINT32_(0x00)                                       /*  (ADCHS_ADCDMASTATINV) Bit invert register  Reset Value */

#define ADCHS_ADCDMASTATINV_Msk               _UINT32_(0x00000000)                                 /* (ADCHS_ADCDMASTATINV) Register Mask  */


/* -------- ADCHS_ADCCNTB : (ADCHS Offset: 0x320) (R/W 32)  -------- */
#define ADCHS_ADCCNTB_RESETVALUE              _UINT32_(0x00)                                       /*  (ADCHS_ADCCNTB)   Reset Value */

#define ADCHS_ADCCNTB_ADCCNTB_Pos             _UINT32_(0)                                          /* (ADCHS_ADCCNTB)  Position */
#define ADCHS_ADCCNTB_ADCCNTB_Msk             (_UINT32_(0xFFFFFFFF) << ADCHS_ADCCNTB_ADCCNTB_Pos)  /* (ADCHS_ADCCNTB)  Mask */
#define ADCHS_ADCCNTB_ADCCNTB(value)          (ADCHS_ADCCNTB_ADCCNTB_Msk & (_UINT32_(value) << ADCHS_ADCCNTB_ADCCNTB_Pos)) /* Assigment of value for ADCCNTB in the ADCHS_ADCCNTB register */
#define ADCHS_ADCCNTB_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCCNTB) Register Mask  */


/* -------- ADCHS_ADCCNTBCLR : (ADCHS Offset: 0x324) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCCNTBCLR_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCCNTBCLR) Bit clear register  Reset Value */

#define ADCHS_ADCCNTBCLR_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCCNTBCLR) Register Mask  */


/* -------- ADCHS_ADCCNTBSET : (ADCHS Offset: 0x328) (R/W 32) Bit set register -------- */
#define ADCHS_ADCCNTBSET_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCCNTBSET) Bit set register  Reset Value */

#define ADCHS_ADCCNTBSET_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCCNTBSET) Register Mask  */


/* -------- ADCHS_ADCCNTBINV : (ADCHS Offset: 0x32C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCCNTBINV_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCCNTBINV) Bit invert register  Reset Value */

#define ADCHS_ADCCNTBINV_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCCNTBINV) Register Mask  */


/* -------- ADCHS_ADCDMAB : (ADCHS Offset: 0x330) (R/W 32)  -------- */
#define ADCHS_ADCDMAB_RESETVALUE              _UINT32_(0x00)                                       /*  (ADCHS_ADCDMAB)   Reset Value */

#define ADCHS_ADCDMAB_ADDMAB_Pos              _UINT32_(0)                                          /* (ADCHS_ADCDMAB)  Position */
#define ADCHS_ADCDMAB_ADDMAB_Msk              (_UINT32_(0xFFFFFFFF) << ADCHS_ADCDMAB_ADDMAB_Pos)   /* (ADCHS_ADCDMAB)  Mask */
#define ADCHS_ADCDMAB_ADDMAB(value)           (ADCHS_ADCDMAB_ADDMAB_Msk & (_UINT32_(value) << ADCHS_ADCDMAB_ADDMAB_Pos)) /* Assigment of value for ADDMAB in the ADCHS_ADCDMAB register */
#define ADCHS_ADCDMAB_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCDMAB) Register Mask  */


/* -------- ADCHS_ADCDMABCLR : (ADCHS Offset: 0x334) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCDMABCLR_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCDMABCLR) Bit clear register  Reset Value */

#define ADCHS_ADCDMABCLR_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCDMABCLR) Register Mask  */


/* -------- ADCHS_ADCDMABSET : (ADCHS Offset: 0x338) (R/W 32) Bit set register -------- */
#define ADCHS_ADCDMABSET_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCDMABSET) Bit set register  Reset Value */

#define ADCHS_ADCDMABSET_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCDMABSET) Register Mask  */


/* -------- ADCHS_ADCDMABINV : (ADCHS Offset: 0x33C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCDMABINV_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCDMABINV) Bit invert register  Reset Value */

#define ADCHS_ADCDMABINV_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCDMABINV) Register Mask  */


/* -------- ADCHS_ADCTRGSNS : (ADCHS Offset: 0x340) (R/W 32)  -------- */
#define ADCHS_ADCTRGSNS_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADCTRGSNS)   Reset Value */

