Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/multiprotocol/ble_zigbee_light_prov_wbz450/firmware/src/packs/WBZ450_DFP/component/adchs.h
#define ADCHS_ADCANLCTLSET_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCANLCTLSET) Register Mask  */


/* -------- ADCHS_ADCANLCTLINV : (ADCHS Offset: 0x40C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCANLCTLINV_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCANLCTLINV) Bit invert register  Reset Value */

#define ADCHS_ADCANLCTLINV_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCANLCTLINV) Register Mask  */


/* -------- ADCHS_ADC7CFG : (ADCHS Offset: 0x670) (R/W 32)  -------- */
#define ADCHS_ADC7CFG_RESETVALUE              _UINT32_(0x00)                                       /*  (ADCHS_ADC7CFG)   Reset Value */

#define ADCHS_ADC7CFG_ADC7CFG_Pos             _UINT32_(0)                                          /* (ADCHS_ADC7CFG)  Position */
#define ADCHS_ADC7CFG_ADC7CFG_Msk             (_UINT32_(0xFFFFFFFF) << ADCHS_ADC7CFG_ADC7CFG_Pos)  /* (ADCHS_ADC7CFG)  Mask */
#define ADCHS_ADC7CFG_ADC7CFG(value)          (ADCHS_ADC7CFG_ADC7CFG_Msk & (_UINT32_(value) << ADCHS_ADC7CFG_ADC7CFG_Pos)) /* Assigment of value for ADC7CFG in the ADCHS_ADC7CFG register */
#define ADCHS_ADC7CFG_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADC7CFG) Register Mask  */


/* -------- ADCHS_ADCFGSHRCLR : (ADCHS Offset: 0x674) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCFGSHRCLR_RESETVALUE          _UINT32_(0x00)                                       /*  (ADCHS_ADCFGSHRCLR) Bit clear register  Reset Value */

#define ADCHS_ADCFGSHRCLR_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADCFGSHRCLR) Register Mask  */


/* -------- ADCHS_ADCFGSHRSET : (ADCHS Offset: 0x678) (R/W 32) Bit set register -------- */
#define ADCHS_ADCFGSHRSET_RESETVALUE          _UINT32_(0x00)                                       /*  (ADCHS_ADCFGSHRSET) Bit set register  Reset Value */

#define ADCHS_ADCFGSHRSET_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADCFGSHRSET) Register Mask  */


/* -------- ADCHS_ADCFGSHRINV : (ADCHS Offset: 0x67C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCFGSHRINV_RESETVALUE          _UINT32_(0x00)                                       /*  (ADCHS_ADCFGSHRINV) Bit invert register  Reset Value */

#define ADCHS_ADCFGSHRINV_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADCFGSHRINV) Register Mask  */


/* -------- ADCHS_ADCSVCONCLR : (ADCHS Offset: 0x684) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCSVCONCLR_RESETVALUE          _UINT32_(0x00)                                       /*  (ADCHS_ADCSVCONCLR) Bit clear register  Reset Value */

#define ADCHS_ADCSVCONCLR_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADCSVCONCLR) Register Mask  */


/* -------- ADCHS_ADCSVCONSET : (ADCHS Offset: 0x688) (R/W 32) Bit set register -------- */
#define ADCHS_ADCSVCONSET_RESETVALUE          _UINT32_(0x00)                                       /*  (ADCHS_ADCSVCONSET) Bit set register  Reset Value */

#define ADCHS_ADCSVCONSET_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADCSVCONSET) Register Mask  */


/* -------- ADCHS_ADCSVCONINV : (ADCHS Offset: 0x68C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCSVCONINV_RESETVALUE          _UINT32_(0x00)                                       /*  (ADCHS_ADCSVCONINV) Bit invert register  Reset Value */

#define ADCHS_ADCSVCONINV_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADCSVCONINV) Register Mask  */


/* -------- ADCHS_ADCSYSCFG0 : (ADCHS Offset: 0x700) (R/W 32)  -------- */
#define ADCHS_ADCSYSCFG0_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCSYSCFG0)   Reset Value */

#define ADCHS_ADCSYSCFG0_AN0_Pos              _UINT32_(0)                                          /* (ADCHS_ADCSYSCFG0)  Position */
#define ADCHS_ADCSYSCFG0_AN0_Msk              (_UINT32_(0x1) << ADCHS_ADCSYSCFG0_AN0_Pos)          /* (ADCHS_ADCSYSCFG0)  Mask */
#define ADCHS_ADCSYSCFG0_AN0(value)           (ADCHS_ADCSYSCFG0_AN0_Msk & (_UINT32_(value) << ADCHS_ADCSYSCFG0_AN0_Pos)) /* Assigment of value for AN0 in the ADCHS_ADCSYSCFG0 register */
#define ADCHS_ADCSYSCFG0_AN1_Pos              _UINT32_(1)                                          /* (ADCHS_ADCSYSCFG0)  Position */
#define ADCHS_ADCSYSCFG0_AN1_Msk              (_UINT32_(0x1) << ADCHS_ADCSYSCFG0_AN1_Pos)          /* (ADCHS_ADCSYSCFG0)  Mask */
#define ADCHS_ADCSYSCFG0_AN1(value)           (ADCHS_ADCSYSCFG0_AN1_Msk & (_UINT32_(value) << ADCHS_ADCSYSCFG0_AN1_Pos)) /* Assigment of value for AN1 in the ADCHS_ADCSYSCFG0 register */
#define ADCHS_ADCSYSCFG0_AN2_Pos              _UINT32_(2)                                          /* (ADCHS_ADCSYSCFG0)  Position */
#define ADCHS_ADCSYSCFG0_AN2_Msk              (_UINT32_(0x1) << ADCHS_ADCSYSCFG0_AN2_Pos)          /* (ADCHS_ADCSYSCFG0)  Mask */
#define ADCHS_ADCSYSCFG0_AN2(value)           (ADCHS_ADCSYSCFG0_AN2_Msk & (_UINT32_(value) << ADCHS_ADCSYSCFG0_AN2_Pos)) /* Assigment of value for AN2 in the ADCHS_ADCSYSCFG0 register */
#define ADCHS_ADCSYSCFG0_AN3_Pos              _UINT32_(3)                                          /* (ADCHS_ADCSYSCFG0)  Position */
#define ADCHS_ADCSYSCFG0_AN3_Msk              (_UINT32_(0x1) << ADCHS_ADCSYSCFG0_AN3_Pos)          /* (ADCHS_ADCSYSCFG0)  Mask */
#define ADCHS_ADCSYSCFG0_AN3(value)           (ADCHS_ADCSYSCFG0_AN3_Msk & (_UINT32_(value) << ADCHS_ADCSYSCFG0_AN3_Pos)) /* Assigment of value for AN3 in the ADCHS_ADCSYSCFG0 register */
#define ADCHS_ADCSYSCFG0_AN4_Pos              _UINT32_(4)                                          /* (ADCHS_ADCSYSCFG0)  Position */
#define ADCHS_ADCSYSCFG0_AN4_Msk              (_UINT32_(0x1) << ADCHS_ADCSYSCFG0_AN4_Pos)          /* (ADCHS_ADCSYSCFG0)  Mask */
#define ADCHS_ADCSYSCFG0_AN4(value)           (ADCHS_ADCSYSCFG0_AN4_Msk & (_UINT32_(value) << ADCHS_ADCSYSCFG0_AN4_Pos)) /* Assigment of value for AN4 in the ADCHS_ADCSYSCFG0 register */
#define ADCHS_ADCSYSCFG0_AN5_Pos              _UINT32_(5)                                          /* (ADCHS_ADCSYSCFG0)  Position */
#define ADCHS_ADCSYSCFG0_AN5_Msk              (_UINT32_(0x1) << ADCHS_ADCSYSCFG0_AN5_Pos)          /* (ADCHS_ADCSYSCFG0)  Mask */
#define ADCHS_ADCSYSCFG0_AN5(value)           (ADCHS_ADCSYSCFG0_AN5_Msk & (_UINT32_(value) << ADCHS_ADCSYSCFG0_AN5_Pos)) /* Assigment of value for AN5 in the ADCHS_ADCSYSCFG0 register */
#define ADCHS_ADCSYSCFG0_AN6_Pos              _UINT32_(6)                                          /* (ADCHS_ADCSYSCFG0)  Position */
#define ADCHS_ADCSYSCFG0_AN6_Msk              (_UINT32_(0x1) << ADCHS_ADCSYSCFG0_AN6_Pos)          /* (ADCHS_ADCSYSCFG0)  Mask */
#define ADCHS_ADCSYSCFG0_AN6(value)           (ADCHS_ADCSYSCFG0_AN6_Msk & (_UINT32_(value) << ADCHS_ADCSYSCFG0_AN6_Pos)) /* Assigment of value for AN6 in the ADCHS_ADCSYSCFG0 register */
#define ADCHS_ADCSYSCFG0_AN7_Pos              _UINT32_(7)                                          /* (ADCHS_ADCSYSCFG0)  Position */
#define ADCHS_ADCSYSCFG0_AN7_Msk              (_UINT32_(0x1) << ADCHS_ADCSYSCFG0_AN7_Pos)          /* (ADCHS_ADCSYSCFG0)  Mask */
#define ADCHS_ADCSYSCFG0_AN7(value)           (ADCHS_ADCSYSCFG0_AN7_Msk & (_UINT32_(value) << ADCHS_ADCSYSCFG0_AN7_Pos)) /* Assigment of value for AN7 in the ADCHS_ADCSYSCFG0 register */
#define ADCHS_ADCSYSCFG0_AN8_Pos              _UINT32_(8)                                          /* (ADCHS_ADCSYSCFG0)  Position */
#define ADCHS_ADCSYSCFG0_AN8_Msk              (_UINT32_(0x1) << ADCHS_ADCSYSCFG0_AN8_Pos)          /* (ADCHS_ADCSYSCFG0)  Mask */
#define ADCHS_ADCSYSCFG0_AN8(value)           (ADCHS_ADCSYSCFG0_AN8_Msk & (_UINT32_(value) << ADCHS_ADCSYSCFG0_AN8_Pos)) /* Assigment of value for AN8 in the ADCHS_ADCSYSCFG0 register */
#define ADCHS_ADCSYSCFG0_AN9_Pos              _UINT32_(9)                                          /* (ADCHS_ADCSYSCFG0)  Position */
#define ADCHS_ADCSYSCFG0_AN9_Msk              (_UINT32_(0x1) << ADCHS_ADCSYSCFG0_AN9_Pos)          /* (ADCHS_ADCSYSCFG0)  Mask */
#define ADCHS_ADCSYSCFG0_AN9(value)           (ADCHS_ADCSYSCFG0_AN9_Msk & (_UINT32_(value) << ADCHS_ADCSYSCFG0_AN9_Pos)) /* Assigment of value for AN9 in the ADCHS_ADCSYSCFG0 register */
#define ADCHS_ADCSYSCFG0_AN10_Pos             _UINT32_(10)                                         /* (ADCHS_ADCSYSCFG0)  Position */
#define ADCHS_ADCSYSCFG0_AN10_Msk             (_UINT32_(0x1) << ADCHS_ADCSYSCFG0_AN10_Pos)         /* (ADCHS_ADCSYSCFG0)  Mask */
#define ADCHS_ADCSYSCFG0_AN10(value)          (ADCHS_ADCSYSCFG0_AN10_Msk & (_UINT32_(value) << ADCHS_ADCSYSCFG0_AN10_Pos)) /* Assigment of value for AN10 in the ADCHS_ADCSYSCFG0 register */
#define ADCHS_ADCSYSCFG0_AN11_Pos             _UINT32_(11)                                         /* (ADCHS_ADCSYSCFG0)  Position */
#define ADCHS_ADCSYSCFG0_AN11_Msk             (_UINT32_(0x1) << ADCHS_ADCSYSCFG0_AN11_Pos)         /* (ADCHS_ADCSYSCFG0)  Mask */
#define ADCHS_ADCSYSCFG0_AN11(value)          (ADCHS_ADCSYSCFG0_AN11_Msk & (_UINT32_(value) << ADCHS_ADCSYSCFG0_AN11_Pos)) /* Assigment of value for AN11 in the ADCHS_ADCSYSCFG0 register */
#define ADCHS_ADCSYSCFG0_Msk                  _UINT32_(0x00000FFF)                                 /* (ADCHS_ADCSYSCFG0) Register Mask  */

#define ADCHS_ADCSYSCFG0_AN_Pos               _UINT32_(0)                                          /* (ADCHS_ADCSYSCFG0 Position)  */
#define ADCHS_ADCSYSCFG0_AN_Msk               (_UINT32_(0xFFF) << ADCHS_ADCSYSCFG0_AN_Pos)         /* (ADCHS_ADCSYSCFG0 Mask) AN */
#define ADCHS_ADCSYSCFG0_AN(value)            (ADCHS_ADCSYSCFG0_AN_Msk & (_UINT32_(value) << ADCHS_ADCSYSCFG0_AN_Pos)) 

/* -------- ADCHS_ADCSYSCFG0CLR : (ADCHS Offset: 0x704) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCSYSCFG0CLR_RESETVALUE        _UINT32_(0x00)                                       /*  (ADCHS_ADCSYSCFG0CLR) Bit clear register  Reset Value */

#define ADCHS_ADCSYSCFG0CLR_Msk               _UINT32_(0x00000000)                                 /* (ADCHS_ADCSYSCFG0CLR) Register Mask  */


/* -------- ADCHS_ADCSYSCFG0SET : (ADCHS Offset: 0x708) (R/W 32) Bit set register -------- */
#define ADCHS_ADCSYSCFG0SET_RESETVALUE        _UINT32_(0x00)                                       /*  (ADCHS_ADCSYSCFG0SET) Bit set register  Reset Value */

#define ADCHS_ADCSYSCFG0SET_Msk               _UINT32_(0x00000000)                                 /* (ADCHS_ADCSYSCFG0SET) Register Mask  */


/* -------- ADCHS_ADCSYSCFG0INV : (ADCHS Offset: 0x70C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCSYSCFG0INV_RESETVALUE        _UINT32_(0x00)                                       /*  (ADCHS_ADCSYSCFG0INV) Bit invert register  Reset Value */

